# yolov5p (SENSEI/HeadCount-identical) — classic anchor-based YOLOv5 for GAP9.
#
# WHY THIS FILE: this is the *exact* architecture that Wiese et al. (Weise2025SENSEI)
# characterised on GAP9 silicon (Table I). Reconstructed from the committed HeadCount tflite
# (sensei-demo-yolov5/src_GAP/.../YOLOv5_HeadCount_128x128.tflite): backbone widths
# 8/16/32/56/104 == width_multiple 0.10 with YOLOv5's ceil-rounded make_divisible; minimal
# depth (all C3 collapse to n=1); SPPF; PANet neck; 3 anchor-based detection heads.
# Verified op count: 18.0 MMAC @128px == the measured 19 MMAC @128 in Table I.
#
# Train with the CLASSIC ultralytics/yolov5 repo (NOT the anchor-free `ultralytics` pip
# package), cfg=this file, weights=yolov5n.pt — same recipe as YOLOv5_HeadCount.ipynb.
# The only difference from HeadCount is nc: 1 -> 9 (final 1x1 conv 18 -> 42 channels,
# <1% of MACs), so the silicon latency/energy at each input size transfer directly.
#
# Deployed input sizes are the MEASURED set (multiples of 64) so energy is a Table-I lookup,
# not an interpolation. We sweep 192..512px: HeadCount mAP climbs 35->85% over that range, so
# tiny insects should gain strongly from resolution, and every size fits on-chip and stays
# milliwatt-class (192px=2.63mJ ... 512px=12.99mJ measured), making resolution a pure
# accuracy-vs-energy knob with BOTH axes measured.

nc: 9
depth_multiple: 0.10   # all C3 -> n=1, matching HeadCount
width_multiple: 0.10   # 64/128/256/512/1024 -> 8/16/32/56/104 (ceil make_divisible)

anchors:               # classic anchor-based head; yolov5 autoanchor refits these to the
  - [10, 13, 16, 30, 33, 23]        # P3/8   insect tiles at train time (keep or let autofit)
  - [30, 61, 62, 45, 59, 119]       # P4/16
  - [116, 90, 156, 198, 373, 326]   # P5/32

backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],   # 0-P1/2   -> 8 ch
   [-1, 1, Conv, [128, 3, 2]],     # 1-P2/4   -> 16 ch
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],     # 3-P3/8   -> 32 ch
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],     # 5-P4/16  -> 56 ch
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],    # 7-P5/32  -> 104 ch
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]]]       # 9

head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],      # 13
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, C3, [256, False]],      # 17 (P3/8)
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],      # 20 (P4/16)
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],
   [-1, 3, C3, [1024, False]],     # 23 (P5/32)
   [[17, 20, 23], 1, Detect, [nc, anchors]]]  # anchor-based Detect (HeadCount-identical)
