# YOLOv5 "pico" for GAP9: depth/width 0.1 keeps params ~0.3M to fit 1.5MB L2 SRAM
# after INT8. C3/SPPF backbone of the SENSEI/Zenodo YOLOv5 lineage; the detection head is
# the Ultralytics anchor-free Detect (the modern `ultralytics` package used for training).
# For strict reproduction of the Zenodo teacher models (classic YOLOv5 v7.0, anchor-based),
# drive the ultralytics/yolov5 repo instead — see docs/rationale.md.
nc: 9
depth_multiple: 0.1
width_multiple: 0.1
backbone:
  [[-1, 1, Conv, [64, 6, 2, 2]],
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]]]
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, C3, [256, False]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],
   [-1, 3, C3, [1024, False]],
   [[17, 20, 23], 1, Detect, [nc]]]
